{
    "_name_or_path": "/workspace/process/adaptllm_law-chat/source",
    "architectures": [
        "LlamaForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 11008,
    "max_position_embeddings": 4096,
    "model_type": "llama",
    "num_attention_heads": 32,
    "num_hidden_layers": 32,
    "num_key_value_heads": 32,
    "pad_token_id": 32000,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-05,
    "rope_scaling": null,
    "rope_theta": 10000.0,
    "tie_word_embeddings": false,
    "torch_dtype": "float16",
    "transformers_version": "4.37.0.dev0",
    "use_cache": true,
    "vocab_size": 32001,
    "quantization_config": {
        "bits": 8,
        "group_size": 32,
        "damp_percent": 0.1,
        "desc_act": true,
        "static_groups": false,
        "sym": true,
        "true_sequential": true,
        "model_name_or_path": null,
        "model_file_base_name": "model",
        "quant_method": "gptq",
        "modules_in_block_to_quantize": [
            [
                "self_attn.k_proj",
                "self_attn.v_proj",
                "self_attn.q_proj"
            ],
            [
                "self_attn.o_proj"
            ],
            [
                "mlp.up_proj",
                "mlp.gate_proj"
            ],
            [
                "mlp.down_proj"
            ]
        ]
    }
}